engineer-ae3o/stm32-hal-library/components/drivers/src/spi.c
#include "stm32f411xe.h"
#include "drivers/gpio.h"
#include "utils/common.h"
#include "drivers/spi.h"
#include "drivers/dma.h"


// The 5 SPI instances: ISRs called when the DMA is done
static dma_done_cb_t s_dma_tx_done_cbs[5] = {};
static dma_done_cb_t s_dma_rx_done_cbs[5] = {};

static void* s_tx_args[5] = {};
static void* s_rx_args[5] = {};


// Mapping for the DMA channels for the 5 SPI channels
static const dma_stream_map_t s_spi_dma_map[5] = {
    // SPI1: DMA not supported: Not enough streams to go round other peripherals
    {
        .tx = {.controller = NULL, .stream = NULL, .stream_number = 0, .nvic_irq_type = 0, .channel = 0},
        .rx = {.controller = NULL, .stream = NULL, .stream_number = 0, .nvic_irq_type = 0, .channel = 0},
    },
    // SPI2
    {
        .tx = {.controller = DMA1, .stream = DMA1_Stream4, .stream_number = 4, .nvic_irq_type = DMA1_Stream4_IRQn, .channel = 0},
        .rx = {.controller = DMA1, .stream = DMA1_Stream3, .stream_number = 3, .nvic_irq_type = DMA1_Stream3_IRQn, .channel = 0},
    },
    // SPI3
    {
        .tx = {.controller = DMA1, .stream = DMA1_Stream7, .stream_number = 7, .nvic_irq_type = DMA1_Stream7_IRQn, .channel = 0},
        .rx = {.controller = DMA1, .stream = DMA1_Stream2, .stream_number = 2, .nvic_irq_type = DMA1_Stream2_IRQn, .channel = 0},
    },
    // SPI4
    {
        .tx = {.controller = DMA2, .stream = DMA2_Stream1, .stream_number = 1, .nvic_irq_type = DMA2_Stream1_IRQn, .channel = 4},
        .rx = {.controller = DMA2, .stream = DMA2_Stream4, .stream_number = 4, .nvic_irq_type = DMA2_Stream4_IRQn, .channel = 4},
    },
    // SPI5: DMA not supported: Not enough streams to go round other peripherals
    {
        .tx = {.controller = NULL, .stream = NULL, .stream_number = 0, .nvic_irq_type = 0, .channel = 0},
        .rx = {.controller = NULL, .stream = NULL, .stream_number = 0, .nvic_irq_type = 0, .channel = 0},
    },
};

// Helpers
[[__gnu__::__always_inline__]] static inline uint8_t get_index(const SPI_TypeDef* handle) {
    if (handle == SPI1) {
        return 0U;
    } else if (handle == SPI2) {
        return 1U;
    } else if (handle == SPI3) {
        return 2U;
    } else if (handle == SPI4) {
        return 3U;
    } else if (handle == SPI5) {
        return 4U;
    } else {
        return 0xFFU;
    }
}

[[__gnu__::__always_inline__]] static inline void isr_tx_helper(SPI_TypeDef* handle, hal_err_t ret, uint8_t idx) {
    if (!s_dma_tx_done_cbs[idx]) {
        return;
    }

    // Transfers require us to poll on the TXE and BSY flags even after data has
    // been shifted out. If they're not in the required state, an error occurred

    // Poll till TXE has been set
    // Skip polling if an error has occurred
    if (ret == HAL_OK) {
        uint32_t timeout = TIMEOUT_CYCLES;
        while (!(handle->SR & SPI_SR_TXE) && (--timeout));
        if (timeout == 0) {
            ret = HAL_ERR_SPI_TXE_FAILED_TO_SET;
        }
    }

    // Poll till BSY has been cleared
    // Skip polling BSY if TXE failed to set
    if (ret == HAL_OK) {
        uint32_t timeout = TIMEOUT_CYCLES;
        while ((handle->SR & SPI_SR_BSY) && (--timeout));
        if (timeout == 0) {
            ret = HAL_ERR_SPI_BSY_FAILED_TO_CLEAR;
        }
    }

    // Save the user callback so we can clear it's global array position
    const dma_done_cb_t local_cb  = s_dma_tx_done_cbs[idx];
    void* const         local_arg = s_tx_args[idx];

    // Only clear the user callback if not in circular mode
    if (!(s_spi_dma_map[idx].tx.stream->CR & DMA_SxCR_CIRC)) {
        s_dma_tx_done_cbs[idx] = NULL;
        s_tx_args[idx]         = NULL;
    }

    // Finally, invoke the user callback
    local_cb(local_arg, ret);
}

[[__gnu__::__always_inline__]] static inline void isr_rx_helper(hal_err_t ret, uint8_t idx) {
    if (!s_dma_rx_done_cbs[idx]) {
        return;
    }

    // Save the user callback so we can clear it's global array position
    const dma_done_cb_t local_cb  = s_dma_rx_done_cbs[idx];
    void* const         local_arg = s_rx_args[idx];

    // Only clear the user callback if not in circular mode
    if (!(s_spi_dma_map[idx].rx.stream->CR & DMA_SxCR_CIRC)) {
        s_dma_rx_done_cbs[idx] = NULL;
        s_rx_args[idx]         = NULL;
    }

    // Finally, invoke the user callback
    local_cb(local_arg, ret);
}


// Public API
hal_err_t spix_clk_enable(SPI_TypeDef* handle, bool enable) {
    if (enable) {
        if (handle == SPI1) {
            RCC->APB2ENR |= RCC_APB2ENR_SPI1EN;
        } else if (handle == SPI2) {
            RCC->APB1ENR |= RCC_APB1ENR_SPI2EN;
        } else if (handle == SPI3) {
            RCC->APB1ENR |= RCC_APB1ENR_SPI3EN;
        } else if (handle == SPI4) {
            RCC->APB2ENR |= RCC_APB2ENR_SPI4EN;
        } else if (handle == SPI5) {
            RCC->APB2ENR |= RCC_APB2ENR_SPI5EN;
        } else {
            return HAL_ERR_INVALID_ARG;
        }

    } else {
        if (handle == SPI1) {
            RCC->APB2ENR &= ~RCC_APB2ENR_SPI1EN;
        } else if (handle == SPI2) {
            RCC->APB1ENR &= ~RCC_APB1ENR_SPI2EN;
        } else if (handle == SPI3) {
            RCC->APB1ENR &= ~RCC_APB1ENR_SPI3EN;
        } else if (handle == SPI4) {
            RCC->APB2ENR &= ~RCC_APB2ENR_SPI4EN;
        } else if (handle == SPI5) {
            RCC->APB2ENR &= ~RCC_APB2ENR_SPI5EN;
        } else {
            return HAL_ERR_INVALID_ARG;
        }
    }

    __DSB();
    return HAL_OK;
}

hal_err_t spi_master_init(SPI_TypeDef* handle, const spi_master_config_t* config) {
    if (handle == NULL || config == NULL) {
        return HAL_ERR_INVALID_ARG;
    }

    // Configure the GPIO pins
    TRY(gpiox_clk_enable(config->gpio_port, true));

    // Alternate function value selection for the GPIOs
    uint8_t alt_val = 0;
    if ((handle == SPI1) || (handle == SPI2)) {
        alt_val = 5;
    } else if (handle == SPI3) {
        alt_val = (config->gpio_port == GPIOD) ? 5U : 6;
    } else if (handle == SPI4) {
        alt_val = (config->gpio_port == GPIOE) ? 5U : 6;
    } else if (handle == SPI5) {
        alt_val = 6;
    } else {
        return HAL_ERR_INVALID_ARG;
    }

    if (config->use_miso) {
        TRY(gpio_set_alternate_function(config->gpio_port, config->miso_pin, alt_val));
        gpio_enable_pullup(config->gpio_port, config->miso_pin, true);
        gpio_set_speed_mode(config->gpio_port, config->miso_pin, GPIO_HIGH_SPEED);
        // MISO cannot be configured as push pull or open drain
    }

    if (config->use_mosi) {
        TRY(gpio_set_alternate_function(config->gpio_port, config->mosi_pin, alt_val));
        gpio_enable_pullup(config->gpio_port, config->mosi_pin, true);
        gpio_set_speed_mode(config->gpio_port, config->mosi_pin, GPIO_HIGH_SPEED);
        gpio_set_output_type(config->gpio_port, config->mosi_pin, GPIO_PUSH_PULL);
    }

    TRY(gpio_set_alternate_function(config->gpio_port, config->sclk_pin, alt_val));
    gpio_enable_pullup(config->gpio_port, config->sclk_pin, true);
    gpio_set_speed_mode(config->gpio_port, config->sclk_pin, GPIO_HIGH_SPEED);
    gpio_set_output_type(config->gpio_port, config->sclk_pin, GPIO_PUSH_PULL);

    // Disable the SPI peripheral
    handle->CR1 &= ~SPI_CR1_SPE;

    // SPI mode
    handle->I2SCFGR &= ~SPI_I2SCFGR_I2SMOD;

    handle->CR1 |= (((config->clk_divider & 0b111U) << SPI_CR1_BR_Pos) | // Clock prescaler
                    SPI_CR1_SSM |                                        // Software slave select control
                    SPI_CR1_SSI |                                        // Set internal slave to high
                    SPI_CR1_MSTR);                                       // SPI in master mode

    handle->CR1 &= ~(SPI_CR1_LSBFIRST | // MSB first
                     SPI_CR1_RXONLY |   // TX and RX
                     SPI_CR1_CRCEN |    // Hardware CRC disable
                     SPI_CR1_CRCNEXT |  // No CRC phase; data phase always
                     SPI_CR1_BIDIMODE | // MOSI and MISO used
                     SPI_CR1_BIDIOE);

