engineer-ae3o/stm32-hal-library/components/drivers/src/spi.c
    // CPOL and CPHA setting
    if (config->cpol) {
        handle->CR1 |= SPI_CR1_CPOL;
    } else {
        handle->CR1 &= ~SPI_CR1_CPOL;
    }

    if (config->cpha) {
        handle->CR1 |= SPI_CR1_CPHA;
    } else {
        handle->CR1 &= ~SPI_CR1_CPHA;
    }

    // 8 or 16 bit transfers
    if (config->use_8bit_mode) {
        handle->CR1 &= ~SPI_CR1_DFF;
    } else {
        handle->CR1 |= SPI_CR1_DFF;
    }

    // Motorolla mode and SS output disable
    handle->CR2 &= ~(SPI_CR2_FRF | SPI_CR2_SSOE);

    return HAL_OK;
}

hal_err_t spi_master_enable(SPI_TypeDef* handle, bool enable) {
    if (handle == NULL) {
        return HAL_ERR_INVALID_ARG;
    }
    if (enable) {
        handle->CR1 |= SPI_CR1_SPE;
    } else {
        handle->CR1 &= ~SPI_CR1_SPE;
    }
    return HAL_OK;
}

hal_err_t spi_master_dma_init(SPI_TypeDef* handle) {
    const uint8_t idx = get_index(handle);
    if (idx == 0xFFU) {
        return HAL_ERR_INVALID_ARG;
    }

    // TX mapping
    DMA_TypeDef*        tx_controller = s_spi_dma_map[idx].tx.controller;
    DMA_Stream_TypeDef* tx_stream     = s_spi_dma_map[idx].tx.stream;
    const uint8_t       tx_channel    = s_spi_dma_map[idx].tx.channel;
    const uint8_t       tx_stream_no  = s_spi_dma_map[idx].tx.stream_number;
    const IRQn_Type     tx_irq_type   = s_spi_dma_map[idx].tx.nvic_irq_type;

    // RX mapping
    DMA_TypeDef*        rx_controller = s_spi_dma_map[idx].rx.controller;
    DMA_Stream_TypeDef* rx_stream     = s_spi_dma_map[idx].rx.stream;
    const uint8_t       rx_channel    = s_spi_dma_map[idx].rx.channel;
    const uint8_t       rx_stream_no  = s_spi_dma_map[idx].rx.stream_number;
    const IRQn_Type     rx_irq_type   = s_spi_dma_map[idx].rx.nvic_irq_type;

    if (tx_controller == NULL || tx_stream == NULL || rx_controller == NULL || rx_stream == NULL) {
        return HAL_ERR_NOT_SUPPORTED;
    }
    // Configure and start the stream
    const dma_stream_config_t stream_config = {
        .deconfigure = false,

        .per_inc        = true,
        .mem_inc        = false,
        .tc_irq_enable  = true,
        .ht_irq_enable  = false,
        .te_irq_enable  = true,
        .dme_irq_enable = false,

        .enable_stream_after_config = false,

        .mode            = DMA_MODE_FIFO,
        .priority        = DMA_PRIORITY_LOW,
        .direction       = DMA_DIR_M_M,
        .per_data_size   = DMA_SIZE_WORD,
        .mem_data_size   = DMA_SIZE_WORD,
        .circular_mode   = DMA_NO_CIRCULAR,
        .flow_controller = DMA_FLOW_CONTROLLER_DMA,

        .channel     = s_crc_dma_map.channel,
        .buffer_size = size,

        .per_addr  = data,
        .mem_buf_0 = &CRC->DR,
        .mem_buf_1 = NULL,

        .controller    = s_crc_dma_map.controller,
        .stream_number = s_crc_dma_map.stream_number,

        .nvic_irq_type     = s_crc_dma_map.nvic_irq_type,
        .nvic_irq_priority = CRC_DMA_NVIC_IRQ_PRIORITY,
    };
    TRY(dma_configure_stream(s_crc_dma_map.stream, &stream_config));

    // TX stream configuration
    TRY(dmax_clk_enable(tx_controller, true));
    TRY(dma_clear_flags(tx_controller, tx_stream_no));
    TRY(dma_disable_stream(tx_stream));
    dma_set_channel(tx_stream, tx_channel);
    dma_set_direct_mode(tx_stream, true);
    dma_set_direction(tx_stream, DMA_DIR_M_P);
    dma_set_flow_controller(tx_stream, true);
    dma_set_stream_priority(tx_stream, DMA_PRIORITY_VERY_HIGH);
    dma_enable_circm_dbm(tx_stream, false, false);
    dma_set_increment(tx_stream, false, true);
    dma_enable_irqs(tx_stream, true, true, false, true);

    // RX stream configuration
    TRY(dmax_clk_enable(rx_controller, true));
    TRY(dma_clear_flags(rx_controller, rx_stream_no));
    TRY(dma_disable_stream(rx_stream));
    dma_set_channel(rx_stream, rx_channel);
    dma_set_direct_mode(rx_stream, true);
    dma_set_direction(rx_stream, DMA_DIR_P_M);
    dma_set_flow_controller(rx_stream, true);
    dma_set_stream_priority(rx_stream, DMA_PRIORITY_VERY_HIGH);
    dma_enable_circm_dbm(rx_stream, false, false);
    dma_set_increment(rx_stream, false, true);
    dma_enable_irqs(rx_stream, true, true, false, true);

    // If the DFF bit in SPIx_CR1 is set, then it's a 16 bit transfer
    const dma_data_size_t dma_data_size = (handle->CR1 & SPI_CR1_DFF) ? DMA_SIZE_HWORD : DMA_SIZE_BYTE;
    dma_set_per_mem_size(tx_stream, dma_data_size, dma_data_size);
    dma_set_per_mem_size(rx_stream, dma_data_size, dma_data_size);

    // Enable SPI requests to DMA
    handle->CR2 |= (SPI_CR2_RXDMAEN | SPI_CR2_TXDMAEN);

    // Enable the DMA stream interrupts
    NVIC_SetPriority(tx_irq_type, SPI_DMA_NVIC_IRQ_PRIORITY);
    NVIC_EnableIRQ(tx_irq_type);

    NVIC_SetPriority(rx_irq_type, SPI_DMA_NVIC_IRQ_PRIORITY);
    NVIC_EnableIRQ(rx_irq_type);

    return HAL_OK;
}


// Polling API
hal_err_t spi_master_transmit_poll(SPI_TypeDef* handle, const void* data, size_t size) {
    if (handle == NULL || data == NULL || size == 0) {
        return HAL_ERR_INVALID_ARG;
    }

    const bool is_16bit_data = handle->CR1 & SPI_CR1_DFF;

    if (is_16bit_data) {
        // Cast to appropriate type
        const uint16_t* buf = (const uint16_t*)data;

        for (size_t i = 0; i < size; i++) {
            // Write data
            handle->DR = buf[i];

            // Poll till the data has been transferred out
            uint32_t timeout = TIMEOUT_CYCLES;
            while (!(handle->SR & SPI_SR_TXE) && (--timeout));
            if (timeout == 0) {
                return HAL_ERR_TIMEOUT;
            }

            // Poll till the data has been received
            timeout = TIMEOUT_CYCLES;
            while (!(handle->SR & SPI_SR_RXNE) && (--timeout));
            if (timeout == 0) {
                return HAL_ERR_TIMEOUT;
            }

            // Read the data register and discard the value
            (void)handle->DR;
        }

    } else {
        // Cast to appropriate type
        const uint8_t* buf = (const uint8_t*)data;

        for (size_t i = 0; i < size; i++) {
            // Write data
            handle->DR = buf[i];

            // Poll till data has been transferred out
            uint32_t timeout = TIMEOUT_CYCLES;
            while (!(handle->SR & SPI_SR_TXE) && (--timeout));
            if (timeout == 0) {
                return HAL_ERR_TIMEOUT;
            }

