engineer-ae3o/stm32-hal-library/components/drivers/src/spi.c
    dma_set_addresses(rx_stream, &handle->DR, rx_data, NULL);
    dma_set_trans_length(rx_stream, size);

    // Save the user passed callback
    if (cb) {
        // Save cb to the TX DMA irq only
        s_dma_tx_done_cbs[idx] = cb;
        s_tx_args[idx]         = arg;
    }

    // Enable DMA TX and RX streams
    TRY(dma_enable_stream(tx_stream));
    TRY_WITH_FUNC(dma_enable_stream(rx_stream), dma_disable_stream(tx_stream));

    return HAL_OK;
}


// To be used only by i2s.c
void spi_master_register_callback(dma_done_cb_t cb, void* arg, uint8_t idx, bool tx) {
    if (tx) {
        s_dma_tx_done_cbs[idx] = cb;
        s_tx_args[idx]         = arg;
    } else {
        s_dma_rx_done_cbs[idx] = cb;
        s_rx_args[idx]         = arg;
    }
}


// DMA interrupts
// SPI2: TX
void DMA1_Stream4_IRQHandler(void) {
    hal_err_t ret = dma_isr_helper(DMA1_Stream4, &DMA1->HIFCR, &DMA1->HISR, DMA_HISR_TCIF4, DMA_HISR_TEIF4, DMA_HISR_DMEIF4, DMA_HISR_HTIF4);
    isr_tx_helper(SPI2, ret, get_index(SPI2));
}

// SPI2: RX
void DMA1_Stream3_IRQHandler(void) {
    hal_err_t ret = dma_isr_helper(DMA1_Stream3, &DMA1->LIFCR, &DMA1->LISR, DMA_LISR_TCIF3, DMA_LISR_TEIF3, DMA_LISR_DMEIF3, DMA_LISR_HTIF3);
    isr_rx_helper(ret, get_index(SPI2));
}

// SPI3: TX
void DMA1_Stream7_IRQHandler(void) {
    hal_err_t ret = dma_isr_helper(DMA1_Stream7, &DMA1->HIFCR, &DMA1->HISR, DMA_HISR_TCIF7, DMA_HISR_TEIF7, DMA_HISR_DMEIF7, DMA_HISR_HTIF7);
    isr_tx_helper(SPI3, ret, get_index(SPI3));
}

// SPI3: RX
void DMA1_Stream2_IRQHandler(void) {
    hal_err_t ret = dma_isr_helper(DMA1_Stream2, &DMA1->LIFCR, &DMA1->LISR, DMA_LISR_TCIF2, DMA_LISR_TEIF2, DMA_LISR_DMEIF2, DMA_LISR_HTIF2);
    isr_rx_helper(ret, get_index(SPI3));
}

// SPI4: TX
void DMA2_Stream1_IRQHandler(void) {
    hal_err_t ret = dma_isr_helper(DMA2_Stream1, &DMA2->LIFCR, &DMA2->LISR, DMA_LISR_TCIF1, DMA_LISR_TEIF1, DMA_LISR_DMEIF1, DMA_LISR_HTIF1);
    isr_tx_helper(SPI4, ret, get_index(SPI4));
}

// SPI4: RX
void DMA2_Stream4_IRQHandler(void) {
    hal_err_t ret = dma_isr_helper(DMA2_Stream4, &DMA2->HIFCR, &DMA2->HISR, DMA_HISR_TCIF4, DMA_HISR_TEIF4, DMA_HISR_DMEIF4, DMA_HISR_HTIF4);
    isr_rx_helper(ret, get_index(SPI4));
}
